{"entries":[{"name":"Oregon Behavioral Health Support Line","contact":"1-800-923-HELP (4357)","location":"A free and confidential resource for all Oregonians who are looking for emotional support. You do not need to be in a mental health crisis to call this line. If you need or want help beyond what the line can provide, you will be connected to those services. This can include community-based services such as housing, food assistance or clinical services. Certified interpreters are also available for those who speak a language other than English. Through this number, you can also connect with Lines for Life (linesforlife.org), a suicide prevention organization with specific resources for youth, military personnel and their families, and those affected by substance abuse problems.","id":0},{"name":"Alcoholics Anonymous ","contact":"24 hour hotline 541-732-1850","location":"https://medfordareaaa.org/meetings/ - in person and phone and videoconferencing meetings available - 100% free","id":1},{"name":"Father Scott Carter","contact":"founder@pilgrimchapelofcontemplativeconscience.org","location":"Spiritual Listening, Support, Advice; Sacraments, including Communion; Recorded Online Blessings at (541) 708-1428. I am a resident of Ashland and an ordained Independent Catholic priest (not Roman Catholic). Additional information is available at https://www.facebook.com/ScottAllanCarter/ and https://www.facebook.com/PilgrimChapelOfContemplativeConscience .","id":2},{"name":"Delaine Due, M.A., ATR-BC, LAT (licensed art therapist)","contact":"541-499-5214","location":"Art supplies and professional support available at my home. Also food, space to nap, shower. I'm a licensed art therapist.","id":3},{"name":"Support Group for Children/Teens/Young Adults","contact":"analyssacamacho@gmail.com","location":"If there are any kids or teens who are struggling with everything going on, I would love to help start a support group of a sort so they don't feel alone, perhaps help them grieve, make peace, or understand what is happening. I am a 21yr old female student at SOU, I have 8 years experience in childcare and 3 years experience in child education working as a class aid/tutor/teacher. Would still implement social distancing. Can meet at my house, the park, or anywhere (I also have a car).","id":4},{"name":"Christina Begley, MA, PCC","contact":"510-387-6174, cb@christinabegley.com","location":"No-cost stress management coaching and support, problem-solving, developing a plan, identifying resources/support, just listening. www.christinabegley.com ","id":5},{"name":"Cynthia Boersma","contact":"541-708-1112, cynthia@cynthiaboersmapsychotherapy.net","location":"Child therapy and adult therapy.  In person sessions and teletherapy available.  No cost & sliding scale for those affected by fire. Ashland location. ","id":6},{"name":"Alaya Ketani CHT CFT CPC","contact":"541.292.2945, empoweringhypnotherapy@gmail.com","location":"Free sessions for those who have lost their homes due to the fires.  Special Sliding Scale for others impacted by the fires. Depth Hypnotherapy, Neuroscience, Nervous System Regulation, Sensorimotor Crisis and Trauma Interventions, Brain Spotting.  Clarity.  Challenged Pregnancies. Career Social Worker - Resource Referral.  Women's Empowerment, And Much More.  www.empoweringhypnotherapy.com  Also Founder/Executive Director of Keeping Ashland Women Safe, 501c3 Nonprofit.    www.empoweringhypnotherapy.com","id":7},{"name":"Erin Dozhier, BA, QMHA","contact":"(541) 450-9297‬","location":"No-cost tarot reading and pagan spiritual services. Offering blessings, prayer rituals, and altar space for those unable to continue their spiritual practices due to loss of home and hearth. I am a Hellenic pagan and work primarily with the harvest and chthonic deities. ","id":8},{"name":"Lauri McKean, LAc","contact":"509-690-7977; lauri@jademountainmedicine.com","location":"Free acupuncture sessions to those who have lost their homes due to the fires.  I also have some free essential oils and chinese herbal pills that are helpful for dealing with stress, smoke (sinus and asthma), insomnia, etc. ","id":9},{"name":"La Clinica West Medford ","contact":"541-535-6239","location":"1307 W Main St, Medford, OR 97501                                                                Providing mental health and medical support to anyone in need. ","id":10},{"name":"Jackson County Crisis Number ","contact":"541.774.8201","location":"Crisis Line is open 24 hours a day 7 days a week. ","id":11},{"name":"Rogue Valley Mentoring","contact":"541-708-6688","location":"Adult volunteer mentors ready to serve youth (1-1 or in small groups), could meet at Expo (we usually mentor in the Phoenix-Talent, Medford & CP school districts)","id":12},{"name":"www.HarvestingHealth.com ","contact":"Stress Reducation Counseling - Marilyn Lindsay, M.Ed. NC  415-279-9750","location":"Available to work with individuals and groups to teach simple techniques for calming the nervous system to acheive better health, decision-making, peace of mind","id":13},{"name":"Emotional Support Suggestions for Wildfires (Adults and Children)","contact":"","location":"Google document with tips from various professionals","id":14},{"name":"Community Grieving Circles","contact":"5414505336","location":"Currently being held every evening at 7pm on Zoom by Crossroads Community DeathCare, Michael and Angela Franklin. Follow @Crossroads Community DeathCare for updates. \"During these circles we will hold space for and with each other to speak our grief and sorrows. We will come together, via Zoom, in non-judgement and respect as we uniquely and authentically honor loss in its many shapes and forms.\"","id":15},{"name":"DIY Papercuts \nCaroline Larrieu Casias, MSW","contact":"diypapercuts@gmail.com","location":"Art and Wellness Self Care Kits - I have a background in Mental Health and Art Therapy, and am creating guided journaling and art activities to support folks as they process Loss and Trauma. Email me for FREE guided journaling. ","id":16},{"name":"Joanne","contact":"541-899-1287 ","location":"Call Joanne for Trauma Counceling available by appointment -  Jacksonville Presbyterian Church - 425 Middle St., Jacksonville","id":17},{"name":"Jade Mountain Medicine Clinic in Ashland - various acupuncturists","contact":"541-482-2107.  By appointment only.  Ongoing throughout the day on Fridays.","location":"Free Individual Acupuncture Treatments for Those Who Lost Their Homes in the Fire.  These are very helpful for promoting relaxation, calm, focus and better sleep.  ","id":18},{"name":"Various Acupuncturists - People's Choice Acupuncture Clinic.  1640 Siskiyou Blvd Suite C, Ashland. ","contact":"Saturday, Sept 19th from 8am to 5pm. - Walk-in  Call 509-690-7977 for info.  No appointment necessary.","location":"Free Acupuncture treatments in a large group room.  For those who have been affected by the fires.  Please wear a mask and loose, comfortable clothing.  Great for promoting relaxation, calm, focus and sleep.","id":19},{"name":"The Almeda Fire in Jackson County","contact":"https://www.facebook.com/crisisresponse/779702329456725?alias=779702329456725&latitude=47.60644745522113&longitude=-122.30423155995105&source=search","location":"Information, solidarity","id":20},{"name":"Medford Area Citizen Cares","contact":"https://www.facebook.com/groups/370307553973996","location":"group asking people to offer what they have and request what they need. It’s basically a group that is open to all people and is providing a logistical way for people to get in touch with each other.","id":21},{"name":"Rogue Valley Emotional Wellness Hotline ","contact":"https://www.medford.k12.or.us/site/default.aspx?PageType=3&DomainID=4&ModuleInstanceID=5359&ViewID=6446EE88-D30C-497E-9316-3F8874B3E108&RenderLoc=0&FlexDataID=18045&PageID=1&Comments=true","location":"Hotline for ANYONE in the Southern Oregon area experiencing grief and loss associated with the recent fires","id":22},{"name":"Dra. Laura Calderón de la Barca, Psicoterapeuta Intuitiva Integral","contact":"info@terapiaparamexico.com","location":"Apoyo emocional grupal por temas de trauma individual y colectivo para quienes sufrieron pérdidas por los incendios en Jackson County, gratuitos, por internet.","id":23}]}