{"entries":{"":[{"name":"AirBnB Housing Available for Free","contact":"https://www.airbnb.com/openhomes/disaster-relief/pacificnorthwestfires2020","location":"Across Oregon","desc":"Click on \"I need housing\" to complete the application. Or click on \"I want to offer housing\" to list your space."}],"APPLEGATE":[{"name":"Brian Carvalho","contact":"541-218-3677","location":"Applegate","desc":"Have place for small trailer or RV 28 ft have power and water.. no smokers.pet maybe.. i have dogs sheep and chickens"},{"name":"Brian Carvalho","contact":"541-218-3677","location":"Applegate","desc":"Spare furnished room.. no smokers no pets i have many already.. "},{"name":"Denise & Kenneth Kalic","contact":"541-291-7804 or 541-326-6723","location":"Applegate area","desc":"Short-term RV space available — we have an RV pad with full hook-ups. We are okay with pets: cats/dogs and will help fence the area around the RV as we have 2 large dogs and a cat that roam the property and it's not fenced. We have space for an additional RV that provides water and power, no sewage. Limited WiFi. English/Spanish"}],"ASHLAND":[{"name":"Alli Newman","contact":"","location":"Ashland Community Riverstone Commons (offer made on Facebook group, and the spreadsheet team is trying to collect more information to update this)","desc":"I have a room in my house. Id like to extend to to someone who has lost theirs. I’m looking for a good match. Not trying to leave anyone out. But I have a 9 month old and a teenager. So I’m thinking if there is someone with a baby, I am equipped, or maybe an elder who has no family."},{"name":"Elizabeth Tobey","contact":"971-219-4784, elizabethparktobey@gmail.com","location":"South/East Ashland near Emigrant Lake","desc":"We run an airbnb from our guest room which is available for now (for approx 2 weeks). It's a room with own entrance, attached bathroom, shower, laundry facilities, king bed, microwave, mini fridge, and air filter. Available short term. No pets. We also have camping available on our tiny farm."},{"name":"Delaine Due","contact":"541-499-5214 text or call","location":"Willow Street in Ashland between Otis and Orange.","desc":"Our house is open for anyone who wants a place to regroup, nap, shower, food, community. Room for several inside at a time while physically safe distances. Look for \"OPEN heart\" flag in front."},{"name":"Gene Tresenfeld","contact":"971-219-4784, elizabethparktobey@gmail.com","location":"Ashland, S. Mountain, uphill from high school","desc":"Downstairs has a queen bed, its own bath & WIFI. Unfortunately, my cat would not be happy with another pet."},{"name":"Greg Panero","contact":"Elizabeth Tobey","location":"Ashland","desc":"We have an extra room with 2 beds and plenty of room for tents. Community kitchen and multiple bathrooms for support. Please don't hesitate to call."},{"name":"Jasmyne Chandler","contact":"541-531-6425, text preferred","location":"Cove road off of Indian Memorial","desc":"We live on 10 acres and can offer camping or RV space as well as space for pets and chickens. Our land is not fenced (except for chicken yard), so it would need to be pets that don't wander, are good with kids and other dogs, and won't kill chickens."},{"name":"Jeanine Moy","contact":"914 830 1950","location":"Vesper Meadow - 16534 D. Indian Memorial Rd","desc":"Primitive camping available in 12' X 16' tent or bring your own, Camper/ RV space available but no hook-ups. Bathroom not available, but potable water"},{"name":"Jordan Stewart","contact":"509-521-4321","location":"N. Ashland","desc":"Nothing luxurious, but I have 2 couches available in my living room.  There is a lot of fridge space for food.  I am barding one person right now.  Dogs roam, so allergies to dogs should be considered."},{"name":"Ila","contact":"415-900-8946","location":"Quiet village- I can offer a place to sleep or a mattress to borrow, text if needed 💕","desc":"Offering mattress in van and/or in living room of home. Not good for people with pet allergies "},{"name":"Lauri McKean","contact":"509-690-7977","location":"Ashland","desc":"Spare room with futon bed for single female or couple.  Share the bathroom and kitchen.  Caveat: I have chemical sensitivities so hygiene and laundry products used need to be natural or unscented.   "},{"name":"Mary Ann and David","contact":"","location":"south Ashland","desc":"spare room with comfortable floor mats for 1-2 people, all welcome, un cuarto para 1-2 personas\n2 steps up to the door, 2 steps down to use restroom"},{"name":"Mihir Rajput","contact":"Ashland/4046671729","location":"south Ashland","desc":"place to sleep/cook/freshen up"},{"name":"Neil Nicholson, Laura Marinelli","contact":"call 541-488-6267 or text 541-301-3559 or 541-324-1450","location":"cove road off dead indian memorial","desc":"we have space for camping and some small animals.  most of proprty not securely fenced.  we have some camping supplies such as tents and sleeping bags we can part with. please feel free to ask, we have alot of extra gear.  there are currently four dogs, three cats, chickens and ducks (securely fenced) on the property.  "},{"name":"Jeff Wyatt","contact":"541-248-4970","location":"Ashland above Lithia Park, 12 minute walk to the Plaza","desc":"Studio apartment with bath, kitchenette, queen bed and small sleeper sofa"},{"name":"Sonya Smith","contact":"Lecirqueashland@gmail.com","location":"Maple way, ashland","desc":"We have spare rooms, bed and blow up bed, can take indoor animals (outdoor space is accessible but not secure)."}],"BANDON":[{"name":"Mr.Pickles","contact":"808-250-7507","location":"Bandon","desc":"I can house a couple or single parent and child (queen bunk futon), run of the house, washer and dryer, 2 cats. You'll need a car."}],"BEND":[{"name":"Bill Martin","contact":"541-203-0016","location":"22540 Rickard Rd, Bend","desc":"Horse property in Bend with room for 30 horses and parking for trailers, etc. "}],"CENTRAL POINT":[{"name":"Tess Siemer","contact":"530-513-2896","location":"Central Point","desc":"Tenemos espacio en la casa - un cuarto privado y también un sofá del tamaño Queen. Tengo una yarda grande para deacansar o para que los niños juegan."}],"GOLD HILL":[{"name":"Lynn and Dan Kellogg","contact":"541-855-9638. 541-531-0557 (Lynn). 541-601-6512 ( Dan)","location":"Gold Hill","desc":"We have a community building 2 miles up Sardine Creek Road outside of Gold Hill. It used to be a restaurant. There is a working stove and refrigerator and 2 bathrooms. There is also a large room. I think 8 people could live there comfortably if they were an extended family or good friends. There is not a lot of privacy. Whoever lives there would need transportation and we would like them to be non smokers. Unfortunately cell service is very spotty in this area but we can easily get the landline hooked back up."}],"PORTLAND":[{"name":"Marissa Wolf","contact":"marissa@pcs.org","location":"Portland, OR","desc":"3 bedroom house available (with our kitty!) while we're traveling Oct 2 - Oct 30"}],"TALENT":[{"name":"Spanish Speaker with Spare Room ","contact":"541-415-2811","location":"Talent, OR","desc":"Spare room with single bed and pullout couches available. Spanish speaking families welcome! Room for up to four. Most comfortable with single mother and children, but please reach out if in need. Has dogs and cats. "}],"Sharon Cleek":[{"name":"Jeffri and Shayna","contact":"Jeffri - 360-269-7405 or Shayna - 541-951-1513","location":"Various","desc":"Call to apply for temporary shelter."}]}}