{"entries":[{"name":"Aiyana Green","contact":"5418404284","location":"SE of Ashland","desc":"We have a pickup and a mostly enclosed 2 horse trailer for animal transport. Could also transport belongings if needed. We live close to the Greensprings.","id":0},{"name":"Central Point shuttle","contact":"","location":"","desc":"Runs between the Expo and Central Point Albertson's/Goodwill on Freeman Rd. The Route 40 serves this shopping center. Anyone wanting to get to the Expo should get off the Route 40 at the stop on Freeman Rd. and walk to the Goodwill to wait in front for the shuttle.","id":1},{"name":"Greg Panero","contact":"925-708-9278","location":"Ashland","desc":"We are available to transport people, small animals, and/or supplies anywhere in The Valley. Also we have tools for and emergency or quick repairs needed. Please call with any and all needs.","id":2},{"name":"Rogue Valley Transportation District ","contact":"","location":"","desc":"Emergency service between Medford and Ashland","id":3},{"name":"Rogue Valley Transportation District ","contact":"","location":"","desc":"RVTD is providing a limited shuttle service only between the Expo and the Goodwill/Albertson's shopping center on Freeman Rd. It leaves every 30 minutes and we currently have it operating mornings and afternoons. (The regular Route 40 also serves the Goodwill/Albertson's shopping center and people can make transfers to our larger system at this location.)","id":4},{"name":"Phoenix/Talent Schools","contact":"","location":"","desc":"Phoenix Talent Schools are using school buses to take their families in need of shelter to the EXPO.","id":5},{"name":"Luca Day","contact":"860-550-2938","location":"Medford","desc":"Have 1 car & 1 SUV. Available to transport people & their items. Safe transportation for LGBTQ+ & PoC. Available most days 10a-4/5p","id":6},{"name":"Jack Hager","contact":"541-429-2677","location":"Medford","desc":"2 drivers available to pick up and deliver people, food, or other supplies in two small cars. Happy to help run your errands!","id":7},{"name":"Nicole Ferer","contact":"650-339-3715","location":"N Ashland","desc":"2 drivers available to transport people, animals, and supplies anywhere in the valley. Please call with any and all needs. Safe for LGBTQ+ and PoC","id":8},{"name":"Jordan Stewart","contact":"509-521-4321","location":"N. Ashland","desc":"1 Truck with canopy and a utility trailer option for transporting needs","id":9},{"name":"Sean & Kathryn ","contact":"541-973-4303","location":"SE Medford","desc":"2 drivers available to run errands, pick up food etc. We have a small car and a pickup truck. Safe for LGBTQ+ and PoC.","id":10},{"name":"Jason Plotts","contact":"541-951-0293","location":"N. Ashland","desc":"Spare vehicle to loan for family in need","id":11},{"name":"Stasie Maxwell","contact":"541-631-9097","location":"S. Ashland","desc":"1 Driver, Honda Element, able to transport people, small animals or supplies","id":12},{"name":"Doug Cochran","contact":"541-488-0138","location":"S. Ashland","desc":"I have a truck and CR-V and am available to transport people, pets and supplies.","id":13},{"name":"Evan Corrales","contact":"(619) 818-0717","location":"S Medford","desc":"I have a truck, can transport people, supplies, pets, etc","id":14},{"name":"South Gateway Medford shuttle","contact":"","location":"","desc":"runs between the Expo and the S.Gateway Walmart and also the S. Medford Goodwill. The S. Walmart is served by the 1X and the S. Medford Goodwill is served by the Route 24. Anyone wanting to get to the Expo needs to wait in front of either store.","id":15},{"name":"Matt Seiler","contact":"209-769-3470 (text if I don't answer)","location":"Phoenix","desc":"We have a small utility trailer and can haul your stuff locally. Safe for everyone.","id":16},{"name":"Marisa Stone","contact":"541-631-9992","location":"E. Medford","desc":"I have an SUV and can transport people  and supplies","id":17},{"name":"Elizabeth Tobey","contact":"971.219.4784, elizabethparktobey@gmail.com","location":"South/East Ashland, near Emigrant","desc":"Have a pickup truck available to loan out to people for moving materials. Stick shift. Older Toyota.","id":18},{"name":"mark stella","contact":"541 535 5880","location":"talent","desc":"8 x 12 open flatbed","id":19},{"name":"","contact":"","location":"","desc":"8 x 14 curtain van/box truck","id":20}]}