{"entries":[{"name":"Hannah","contact":"510-495-5436","language":"Hindi/Urdu/Persian","desc":"translation in writing, by phone, or in person (Ashland-Rogue Valley area) //  می توانم از زبان فارسی یا از زبان انگلیسی ترجمه بکنم // میں انگریزی یا  اردو سے ترجمہ كر سكتی ہوں // मैं अंग्रेज़ी या िहन्दी से अनुवाद कर सक्ती हुं","id":0},{"name":"","contact":"https://docs.google.com/spreadsheets/d/1dkEmAsPxB8vyKzBIiFfVW0DjGB_no7eCfAyFJyJ2UfA/edit?usp=sharing","language":"Español","desc":"Lista de recursos en el Rogue Valley en Ingles y Español","id":1},{"name":"Tess","contact":"tessikamiller@gmail.com ","language":"Inglés / Español","desc":"translation in writing, by phone, or in person (Central Point) / ofrezco traducción de todos tipos","id":2},{"name":"Calvin ","contact":"calvin.c.harrison@gmail.com","language":"Español / عربي","desc":"Can provide written translations, some verbal translation but I'm not based in US // ofrezco traducción escrita y puedo ayudar con traducción vivo pero será más dificíl porque no estoy en los EEUU // ممنك اترجم مستندات او رسائل مكتوبة ولاكن الترجمة المباشرة صعبة الى حد ما لآني ليست في الولايات المتحدة","id":3},{"name":"Alessandro","contact":"alessandro.broido@district6.org","language":"Inglés / Español","desc":"Written translations, over the phone interpretation/general communication and outreach in Spanish, in person interpretation on weekends. Traducciones escritas, interpretación telefónica / comunicación general y asistencia en español, interpretación en persona los fines de semana.","id":4},{"name":"Juliana","contact":"jufelix16@gmail.com","language":"Português / Inglês","desc":"I can help with any type of communication or informal translation, either ir person or over the phone.\nSe você precisa de ajuda para traduzir algo ou se comunicar em inglês, por favor, entre em contato! ficarei feliz em ajudar. ","id":5},{"name":"Evan","contact":"evan@wilsontranslation.com","language":"German","desc":"Written, verbal communication. By phone mainly, but can do in-person with appointment","id":6},{"name":"Mary","contact":"marysackley@gmail.com","language":"español/inglés","desc":"spoken or written translation, phone interpretation or in person (very flexible schedule) and general assistance, including medical interpretation. Traducciones escritas, interpretación telefónica / comunicación general y asistencia en español, interpretación médico. located in ashland","id":7}]}